Repository: 84000/data-translation-memory
Catalog: toh145-v4.tmx
Source language: bo
Languages: en

source: འདི་ལྟ་སྟེ། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་ལ་མཁས་པ་ཡང་དག་པར་བརྗོད་པར་བྱའོ། །རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་ཀུན་དུ་སྤྱད་པ་དང་། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་དུ་འཇུག་པ་དང་། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་དུ་རྣམ་པར་དཔྱད་པ་དང་། ཆོས་ཀྱི་རྒྱལ་པོའི་དབང་བསྐུར་བ་དང་། ཆོས་ཀྱི་རྒྱལ་པོའི་བྱིན་གྱི་རླབས་དང་། ཆོས་ཀྱི་རྒྱལ་པོའི་ཕ་རོལ་གནོན་པ་དང་། ཆོས་ཀྱི་རྒྱལ་པོའི་གནས་དང་། ཆོས་ཀྱི་རྒྱལ་པོའི་བཀའ་ལུང་ཡང་དག་པར་བརྗོད་པར་བྱའོ།
en: They consist in being correctly taught: (1) the expertise concerning the royal palace, (2) the modes of conduct in the royal palace, (3) the entering of the royal palace, (4) the investigation of the royal palace, (5) the consecration as a Dharma king, (6) the blessings as a Dharma king, (7) the punishment of the opponents of a Dharma king, (8) the abode of a Dharma king, (9) and the orders of a Dharma king.

source: འདི་ལྟར་དེའི་སེམས་ཤས་ཆེར་ཆོས་ཐམས་ཅད་ལ་སྒྲིབ་པ་མེད་པར་བསྒྲུབ་པ་ལ་འཇུག་ཅིང་གོང་དུ་གནས་གང་དག་ཐོས་པའི་གནས་དེ་དག་ལ་ཡང་བདག་ཉིད་སྒྲུབ་ཀྱི་གཞན་གྱི་དྲིང་ལ་མི་འཇོག་པ་ཐོབ་པའི་ཕྱིར་ཏེ།
en: It is because for the most part their minds engage in realization without obscurations regarding all phenomena, and those subjects of learning acquired previously are mastered with their own application and without recourse to dependence on others.

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག་འདི་ནི་རྒྱལ་ཚབ་ཀྱི་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་གཞག་པའོ།
en: O sons of the victors, such is the category of bodhisattvas who are regents. (10)

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག་དེ་ལ་དབང་བསྐུར་བ་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་གཞག་པ་གང་ཞེ་ན།
en: “O sons of the victors, what is the category of bodhisattvas who have received consecration?

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག་འདི་ལ་དབང་བསྐུར་བ་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཤེས་པ་མངོན་པར་སྒྲུབ་པ་བཅུ་དང་ལྡན་པ་ཡིན་ཏེ།
en: O sons of the victors, bodhisattvas who have received consecration possess ten realizations of knowledge.

source: འཇིག་རྟེན་གྱི་ཁམས་གྲངས་མེད་པ་རབ་ཏུ་གཡོ་བར་བྱེད་པ་མང་བ་ཡིན། འཇིག་རྟེན་གྱི་ཁམས་གྲངས་མེད་པ་བྱིན་གྱིས་རློབ་པ་མང་བ་ཡིན། འཇིག་རྟེན་གྱི་ཁམས་གྲངས་མེད་པ་སེམས་གཅིག་གིས་འདའ་བར་བྱེད་པ་མང་བ་ཡིན། འཇིག་རྟེན་གྱི་ཁམས་གྲངས་མེད་པ་ཡོངས་སུ་སྦྱོང་བ་བྱེད་པ་མང་བ་ཡིན། སེམས་ཅན་གྲངས་མེད་པའི་སེམས་གཅིག་གིས་རྣམ་པར་རིག་པར་བྱེད་པ་མང་བ་ཡིན། འཇིག་རྟེན་གྱི་ཁམས་གྲངས་མེད་པ་ལ་རྣམ་པར་ལྟ་བ་མང་བ་ཡིན། སེམས་ཅན་གྲངས་མེད་པའི་སེམས་ཀྱི་སྤྱོད་པ་ལ་སེམས་གཅིག་གིས་རྣམ་པར་དཔྱོད་པ་ལ་མཁས་པ་ཡིན། སེམས་ཅན་གྲངས་མེད་པའི་དབང་པོ་སེམས་གཅིག་གིས་རྟོགས་པར་བྱེད་པ་ལ་མཁས་པ་ཡིན། སེམས་ཅན་གྲངས་མེད་པ་འདུལ་བ་ལ་མཁས་པ་ཡིན། སེམས་ཅན་གྲངས་མེད་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སེམས་ལ་འཛུད་པ་ལ་མཁས་པ་ཡིན་ནོ། །
en: (1) many ways of making innumerable spheres of the world shake, (2) many ways of blessing innumerable spheres of the world, (3) many ways of passing beyond innumerable spheres of the world with a single thought, (4) many ways of purifying innumerable spheres of the world, (5) many ways of making innumerable sentient beings known with a single thought, (6) many ways of viewing innumerable spheres of the world, (7) expertise in investigating the mental activity of innumerable sentient beings with a single thought, (8) expertise in making understood the faculties of innumerable sentient beings with a single thought, (9) expertise in disciplining innumerable sentient beings, and (10) expertise in introducing innumerable sentient beings to the mind of omniscience.

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག་རྒྱལ་ཚབ་ཀྱི་ས་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་མན་ཆད་གང་གིས་ཀྱང་དབང་བསྐུར་བ་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེའི་ལུས་ཀྱི་ལས་ཤེས་པར་མི་ནུས།
en: “O sons of the victors, bodhisattvas on the level of regent and below cannot know the bodily deeds of bodhisattvas who have received consecration.

source: ངག་གི་ལས་ཤེས་པར་མི་ནུས། ཡིད་ཀྱི་ལས་ཤེས་པར་མི་ནུས། རྫུ་འཕྲུལ་ཤེས་པར་མི་ནུས། རྫུ་འཕྲུལ་རྣམ་པར་ལྟ་བ་ཤེས་པར་མི་ནུས།
en: Nor can they understand their verbal deeds, mental deeds, magical power, or magical vision.

source: འདས་པའི་དུས་ལ་རྣམ་པར་ལྟ་བ་ཤེས་པར་མི་ནུས་ཤིང་མངོན་པར་འདུ་བྱེད་པ་ཤེས་པར་མི་ནུས།
en: Neither do they know how to see what is in past times, nor can they know their karmic conditioning.

source: བློས་རྣམ་པར་ལྟ་བ་ཤེས་པར་མི་ནུས། སེམས་ཀྱི་ཡུལ་ཤེས་པར་མི་ནུས། ཡེ་ཤེས་ཀྱི་སྤྱོད་ཡུལ་ཤེས་པར་མི་ནུས་ཏེ།
en: They do not know how they see with the mind, nor can they know their objects of mind or the sphere of their experience of gnosis.

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག་འདི་ནི་དབང་བསྐུར་བ་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔའོ།
en: O sons of the victors, such are bodhisattvas who have received consecration.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག་དབང་བསྐུར་བ་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་ལ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དག་གནས་བཅུ་ཡང་དག་པར་བརྗོད་པ་མཛད་དེ།
en: “O sons of the victors, to bodhisattvas who have received consecration will be taught ten things by the blessed buddhas.

source: དུས་གསུམ་ཤེས་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཤེས་པ་དང་། ཆོས་ཀྱི་དབྱིངས་དབྱེར་མེད་པ་ཤེས་པ་དང་། ཆོས་ཀྱི་དབྱིངས་མཐའ་དང་དབུང་མེད་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་རྒྱས་པར་དགང་བ་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་སྣང་བར་བྱེད་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་བྱིན་གྱིས་བརླབ་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་ཤེས་པ་དང་། ཆོས་ཐམས་ཅད་མངོན་པར་ཤེས་པ་དང་། སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་མཐའ་ཡས་པ་བརྗོད་པ་མཛད་དོ།
en: (1) knowing the three times, (2) knowing the Buddhadharma, (3) knowing that the dharmadhātu is indivisible, (4) knowing that the dharmadhātu is without limit and without center, (5) knowing how to suffuse all the spheres of the world, (6) knowing how to illuminate all the spheres of the world, (7) knowing how to bless all the spheres of the world, (8) thorough knowledge of all sentient beings, (9) clairvoyant knowledge of all phenomena, and (10) the infinite gnosis of the Buddha.

source: འདི་ལྟར་དེ་ནི་ཤས་ཆེར་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་སེམས་འཇུག་པའི་ཕྱིར་ཏེ།
en: Because for the most part they apply their minds to knowing everything.

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག་འདི་ནི་དབང་བསྐུར་བ་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་གཞག་པའོ།
en: O sons of the victors, such is the category of bodhisattvas who have received consecration.”

source: །བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་བློ་གྲོས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་གཞག་པ་བཅུ་བཤད་མ་ཐག་ཏུ་དེ་ནས་དེའི་ཚེ་སངས་རྒྱས་ཀྱི་མཐུས་ཕྱོགས་བཅུའི་ཕྱོགས་རེ་རེར་ཡང་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་ཕྲག་བཅུའི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་རྣམ་པ་དྲུག་ཏུ་གཡོས།
en: Immediately after the bodhisattva Dharma­mati explained the ten bodhisattva categories of bodhisattva great beings through the power of the Buddha, world realms numbering as many as the atoms in ten thousand buddhafields shook in every direction.

source: རབ་ཏུ་གཡོས། ཀུན་དུ་རབ་ཏུ་གཡོས་སོ། །
en: They shook strongly and shook violently.

source: འགུལ། རབ་ཏུ་འགུལ། ཀུན་དུ་རབ་ཏུ་འགུལ་ཏོ། །
en: They quaked, quaked strongly, and quaked violently.

source: ལྡེག །རབ་ཏུ་ལྡེག །ཀུན་དུ་རབ་ཏུ་ལྡེག་གོ།
en: They trembled, trembled strongly, and trembled violently.

source: །འུར་འུར་རབ་ཏུ་འུར་འུར། ཀུན་དུ་རབ་ཏུ་འུར་འུར་རོ། །
en: They were disturbed, strongly disturbed, and violently disturbed.

source: ཆེམ་ཆེམ། རབ་ཏུ་ཆེམ་ཆེམ། ཀུན་དུ་རབ་ཏུ་ཆེམ་ཆེམ་མོ། །འཁྲུགས།
en: They shuddered, shuddered strongly, and shuddered violently.

source: རབ་ཏུ་འཁྲུགས། ཀུན་དུ་རབ་ཏུ་འཁྲུགས་སོ།
en: And they were agitated, strongly agitated, and violently agitated.

source: །སངས་རྒྱས་ཀྱི་མཐུ་དང་། ཆོས་ཉིད་ཐོབ་པས་ལྷའི་མེ་ཏོག་གི་སྤྲིན་གྱི་ཆར་ཡང་མངོན་པར་བབ་བོ། །ལྷའི་བདུག་པའི་སྤྲིན་གྱི་ཆར་ཡང་མངོན་པར་བབ་པོ། །ལྷའི་སྤོས་ཀྱི་སྤྲིན་གྱི་ཆར་ཡང་མངོན་པར་བབ་པོ། །ལྷའི་ཕྱེ་མའི་སྤྲིན་གྱི་ཆར་དང་། ལྷའི་ཕྲེང་བའི་སྤྲིན་གྱི་ཆར་དང་། ལྷའི་གོས་ཀྱི་སྤྲིན་གྱི་ཆར་དང་། ལྷའི་རིན་པོ་ཆེའི་སྤྲིན་གྱི་ཆར་དང་། ལྷའི་པད་མའི་སྤྲིན་གྱི་ཆར་དང་། ལྷའི་རྒྱན་ཕྲེང་གི་སྤྲིན་གྱི་ཆར་དང་། ལྷའི་རྒྱན་གྱི་སྤྲིན་གྱི་ཆར་ཡང་མངོན་བར་བབ་པོ། །
en: By the power of the Buddha and through the attainment of the ultimate nature, a shower of divine flowers poured down from the clouds. From the clouds, there also fell showers of divine incense, of divine fragrance, of divine incense powder, of divine flower garlands, of divine textiles, of divine jewels, of divine lotuses, of divine necklaces, and of divine ornaments.

source: ལྷའི་སིལ་སྙན་རྣམས་ཀྱང་མ་དཀྲོལ་བར་སྒྲ་བྱུང་ངོ་། །ལྷའི་སྣང་བ་ཡང་རབ་ཏུ་བྱུང་ངོ་། །ལྷའི་ང་རོ་ཡང་གྲག་གོ།
en: Divine cymbals sounded without being played, divine light shone forth, and divine cheers sounded forth.

source: །གླིང་བཞི་པ་འདིར་རི་རབ་ཀྱི་རྩེ་མོར་ལྷའི་དབང་པོའི་ཁང་པར་ཇི་ལྟ་བ་དེ་བཞིན་དུ་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་ཡང་ཆོས་བསྟན་པ་འདི་ཁྱབ་པར་གྱུར་ནས་བྱུང་སྟེ་ལྷག་ཆད་མེད་དོ།
en: In this world with its four continents, and in all world realms, this Dharma teaching pervaded everywhere without omission or repetition, just as in the dwelling place of the king of gods on Mount Meru.

source: །ཚིག་འབྲུ་འདི་དག་ཉིད་ཀྱིས་དོན་འདི་ཉིད་སྟོན་ཏོ།
en: And by these very words, this same meaning was taught.

source: །སངས་རྒྱས་ཀྱི་མཐུས་
en: Through the power of the Buddha,

source: སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་ཕྲག་བཅུའི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་རྣམས་ཀྱི་ཕ་རོལ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་ཕྲག་བཅུའི་རྡུལ་ཕྲ་རབ་སྙེད་ལྷགས་ཏེ།
en: as many bodhisattvas as there are atoms in ten thousand buddhafields arrived from beyond as many world realms as there are atoms in ten thousand buddhafields.

source: ཕྱོགས་བཅུ་རྒྱས་པར་བཀང་ནས་འདི་སྐད་ཅེས་འཛེར་ཏོ།
en: Filling up space throughout the ten directions, they said,

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དེ་ལྟར་ཁྱོད་བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ཉིད་འདི་སྟོན་པ་ལེགས་སོ་ལེགས་སོ།
en: “O son of the victors, it is excellent, excellent that you are teaching the true nature of bodhisattvas.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་བདག་ཅག་ཀྱང་མིང་ཆོས་ཀྱི་བློ་གྲོས་ཞེས་བྱ་བ་ཤ་སྟག་སྟེ།
en: O son of the victors, we, too, are all named Dharma­mati.

source: འཇིག་རྟེན་གྱི་ཁམས་ཆོས་ཀྱི་སྤྲིན་ཅེས་བྱ་བ་དག་ནས་དེ་བཞིན་གཤེགས་པའི་མཚན་ཆོས་ཀྱི་བློ་གྲོས་བཟང་པོ་ཞེས་བྱ་བ་ཤ་སྟག་གི་ཐད་ནས་འདིར་ཕྱིན་ཏོ།
en: We have come here from world realms called Dharmamegha, from the presence of tathāgatas who are all named Dharma­mati­bhadra.

source: །སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས་
en: By the blessing-power of the Buddha,

source: དེ་དག་ཐམས་ཅད་དུ་ཆོས་བསྟན་པ་འདི་བྱུང་སྟེ།
en: this Dharma instruction occurred for all of them;

source: འཁོར་འདི་ལྟ་བུ་དག་གི་ནང་དུ་ཚིག་འབྲུ་འདི་དག་གིས་དོན་འདི་ཉིད་སྟོན་ཏེ།
en: within an audience such as this, the same sense is being expressed by these very words,

source: ལྷག་ཆད་མེད་དོ།
en: with nothing added or left out.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་བདག་ཅག་ནི་ཁྱོད་ཀྱི་དབང་དུ་གྱུར་ཏེ།
en: O son of the victors, we have come under your power,

source: སངས་རྒྱས་ཀྱི་མཐུས་འཇིག་རྟེན་གྱི་ཁམས་འདིར་ཕྱིན་ཏོ།
en: and by the power of the Buddha we all came to this world sphere.

source: །བདག་ཅག་ཇི་ལྟར་འཇིག་རྟེན་གྱི་ཁམས་འདིར་ཕྱིན་པ་དེ་བཞིན་དུ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་གླིང་བཞི་པ་ཐམས་ཅད་དུ་རི་རབ་ཀྱི་རྩེ་མོར་ལྷའི་དབང་པོའི་ཁང་པ་རྣམས་སུ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་ཞིང་བཅུའི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་ཕྱིན་པར་གྱུར་ཏོ།། །།
en: And just as we came to this world sphere, so too as many bodhisattvas as there are atoms in ten thousand buddhafields went to the residences of the lords of gods at the peak of Mount Sumeru of all the four-continent worlds in every world sphere throughout the ten directions.”

source: དེ་ནས་སངས་རྒྱས་ཀྱི་མཐུས་
en: Then, by the power of the Buddha,

source: བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་བློ་གྲོས་ཀྱིས་ཕྱོགས་བཅུར་རྣམ་པར་བལྟས་ཏེ།
en: the bodhisattva Dharma­mati looked in the ten directions and,

source: ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དང་། ཆོས་ཀྱི་དབྱིངས་ལ་ཡང་རྣམ་པར་བལྟས་ནས་
en: after seeing the fully-equipped retinue and the dharmadhātu,

source: དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ།
en: spoke these verses:

source: །རང་བྱུང་ཤིན་ཏུ་རྣམ་དག་བློ་མངའ་བ།
en: “Having seen the Buddha, who has a mind that is self-arisen and immaculate,

source: །མཛེས་ཤིང་གཟུགས་ཀྱི་སྟོབས་དང་ལྡན་གྱུར་པ།
en: Who possesses beauty and power of body,

source: །བསྙེན་དཀའ་མཚན་གྱིས་བརྒྱན་པ་མཐོང་གྱུར་ནས།
en: And who is ornamented by marks difficult to approach,

source: །བྱང་ཆུབ་དོན་དུ་བརྟན་པ་སེམས་འཇོག་བྱེད།
en: They set their mind firmly on the goal of awakening.

source: །དོ་ཟླ་མེད་པའི་རྫུ་འཕྲུལ་སྟོབས་རྣམས་དང་།
en: “Having seen the Buddha’s matchless magical powers,

source: །ཀུན་བརྗོད་བཟང་དང་རྗེས་སུ་བསྟན་པ་དང་།
en: Excellent miracles of clairvoyant prophecy, and miracles of insightful instruction,

source: །སྡུག་བསྔལ་བཟོད་རླག་འཇིག་རྟེན་འགྲོ་མཐོང་ནས།
en: And having seen living beings of the world with their unbearable suffering,

source: །ཡོན་ཏན་ཀུན་གྱི་འབྱུང་གནས་དེ་བཞིན་གཤེགས། །ཀུན་དུ་བཟང་པོའི་ཡོན་ཏན་ཐོས་གྱུར་ནས།
en: “Having heard about the qualities of Samanta­bhadra And the source of all qualities, the tathāgata,

source: །ནམ་མཁའི་དབྱིངས་འདྲ་འགྱུར་བ་མེད་པ་ཡི། །བྱང་ཆུབ་དོན་དུ་བརྟན་པ་སེམས་འཇོག་བྱེད།
en: They set their thought firmly on the goal of awakening That is unchanging like the sphere of space.

source: །གནས་རྣམས་ཇི་སྙེད་གང་དག་ཡོད་གྱུར་དང་།
en: “To gain understanding of the extent of all that is possible—

source: །རང་བཞིན་གནས་པའི་གནས་རྣམས་གཞན་དག་ཀྱང་།
en: What is present, and other possibilities that may intrinsically exist—

source: །གཞན་མིན་དངོས་པོར་རྣམ་པར་རྟོགས་བྱའི་ཕྱིར།
en: And also of all else that is not,

source: །འདས་དང་མ་འོངས་ད་ལྟར་དུས་དག་ན། །དགེ་དང་མི་དགེའི་ལས་རྣམས་གང་ཡོད་པ།
en: “Whatever virtuous and nonvirtuous deeds exist In the three times—past, present, and future—

source: །དེ་དག་རྒྱུ་རྣམས་རྟོགས་པར་བྱ་བའི་ཕྱིར།
en: To gain understanding of their causes

source: །ཏིང་འཛིན་བསམ་གཏན་རྣམ་ཐར་སྤྱོད་པ་དང་།
en: “The absorptions, concentrations, and the practice of the emancipations,

source: །དེ་བཞིན་སྙོམས་འཇུག་རྣམ་དག་མཐར་ཐུག་པ།
en: And similarly the meditative accomplishments, pure and ultimate—

source: །དེ་དག་གནས་སྐབས་རྟོགས་པར་བྱ་བའི་ཕྱིར།
en: In order to understand them provisionally

source: །བྱང་ཆུབ་དོན་དུ་བརྟན་པ་སེམས་འདི་འཇོག
en: They set their thought firmly on the goal of awakening.

source: །འཇིག་རྟེན་བརྩོན་འགྲུས་སྟོབས་དང་དབང་པོ་རྣམས། །ཅི་འདྲ་ཅི་འདྲ་དེ་ཡི་དེ་དང་དེར། །རིམ་པ་དེ་དག་རྟོགས་པར་བྱ་བའི་ཕྱིར། །
en: “In order to understand the progressive stages Of mundane diligence, powers, and faculties As they really are, each and every one of them,

source: བྱང་ཆུབ་དོན་དུ་བརྟན་པ་སེམས་འཇོག་བྱེད།
en: They set their thought firmly on the goal of awakening.

source: །འཇིག་རྟེན་ཀུན་གྱི་མོས་པ་ཅི་འདྲ་དང་། །ལྷག་པའི་བསམ་བ་ཐ་དད་རྣམ་གསུམ་ནས། །བསྟན་བཅོས་དུ་མ་རྟོགས་པར་བྱ་བའི་ཕྱིར།
en: “In order to understand numerous treatises According to the inclinations of the whole world And out of the three distinct kinds of excellent intention,

source: །རྣམ་པ་སྣ་ཚོགས་རྣམ་པ་དུ་མའི་ཁམས།
en: “All the numerous constituents in all their varieties,

source: །གང་དག་འཇིག་རྟེན་གསུམ་འདིར་ཡོད་ཀུན་གྱི།
en: That exist here in the three worlds—

source: །ཁམས་ཀྱི་རང་བཞིན་རྟོགས་པར་བྱ་བའི་ཕྱིར།
en: In order to understand the nature of those constituents

source: །བྱང་ཆུབ་དོན་དུ་བརྟན་པ་སེམས་དེ་འཇོག
en: They set their thought firmly on the goal of awakening.

source: །ཆོས་འདིར་ཀུན་དུ་འགྲོ་བར་གང་གྱུར་ཅིང་།
en: “In this Dharma where there are ways that go everywhere,

source: །དགེ་བའི་འཇུག་པ་གང་ཡང་རབ་འཇུག་པ། །ཡང་དག་རང་བཞིན་རྟོགས་པར་བྱ་བའི་ཕྱིར།
en: In order to correctly understand the nature of those Whom they will introduce to virtuous action and establish them there,

source: །ཞིང་རྣམས་ཐམས་ཅད་ཇི་ལྟར་འབྱུང་བ་དང་།
en: “ ‘How do all the realms arise?

source: །སེམས་ཅན་ཇི་ལྟར་ས་ལས་འབྱུང་འགྱུར་ཞེས།
en: And how do sentient beings arise from the earth?’—

source: །ཆགས་མེད་མིག་ནི་རབ་ཏུ་དབྱེ་བའི་ཕྱིར། །བྱང་ཆུབ་དོན་དུ་བརྟན་པ་སེམས་འདི་འཇོག །
en: In order to open wide the eye of nonattachment They set their thought firmly on the goal of awakening.

source: འདས་པའི་དུས་དང་ད་ལྟར་བྱུང་དུས་ན། །སེམས་ཅན་རིས་དངོས་མཚན་ཉིད་གང་ཡོད་དང་། །སྔོན་གྱི་གནས་རྣམས་རྟོགས་པར་བྱ་བའི་ཕྱིར།
en: “In order to understand what characteristics and types of sentient beings Existed in the past, and also now in present times, As well as the places of their previous lives,

source: །བྱང་ཆུབ་དོན་དུ་བརྟན་བ་སེམས་འདི་འཇོག །
en: They set their thought firmly on the goal of awakening.

source: ཇི་ལྟར་འགྲོ་བར་སེམས་ཅན་འཆིང་བྱེད་པ། །ཀུན་དུ་སྦྱོར་བ་འཇིག་རྟེན་གང་ཡོད་པའི། །ཉོན་མོངས་ཟད་པ་རྟོགས་པར་བྱ་བའི་ཕྱིར།
en: “In order to understand the exhaustion Of the fetters that there are in the world Binding sentient beings to their migrations, the defilements,

source: །བྱང་ཆུབ་དོན་དུ་བརྟན་པ་སེམས་འདི་འཇོག །
en: They set their thought firmly on the goal of awakening.

source: འཇིག་རྟེན་གསུམ་ན་ཐ་སྙད་གང་བཏགས་དང་། །ངག་ལམ་སྔགས་ཚུལ་སྤྱོད་པ་གང་ཡོད་པ། །བརྡ་ཡི་བདེན་པ་རྟོགས་པར་བྱ་བའི་ཕྱིར།
en: “In order to understand the truth as expressed in symbols, Including all the designated terms in use in the three worlds And all the forms of mantra that are pathways of speech,

source: ཆོས་རྣམས་ཐམས་ཅད་བརྗོད་དུ་མེད་པ་སྟེ། །སྟོང་པ་མི་གཡོ་རང་བཞིན་ངོ་བོ་ཉིད། །དོན་དམ་བདེན་པ་རྟོགས་པར་བྱ་བའི་ཕྱིར།
en: “All phenomena being inexpressible, Their nature and essence never moving from the empty, In order to understand the ultimate truth

source: །ཞིང་རྣམས་དག་ཏུ་ས་གཡོ་བསྟན་པ་དང་། །རྒྱ་མཚོ་དག་ཀྱང་རྣམ་པར་འཁྲུགས་པ་དང་། །དེ་བཞིན་གཤེགས་ཀྱི་རྫུ་འཕྲུལ་བསྟན་པའི་ཕྱིར།
en: “In order to display the wonders of the Tathāgata, Manifesting earthquakes in the worlds And the violent churnings of oceans,

source: །འོད་ཟེར་རྩེ་མོ་རེ་ལས་འོད་ཟེར་རྣམས།།དེ་བཞིན་ཕྱོགས་བཅུ་ཀུན་དུ་རབ་ཏུ་འགྱེད། །དེ་དག་འོད་གཅིག་རྟོགས་པར་བྱ་བའི་ཕྱིར།
en: “In order to understand as one light The light rays that spread out in the ten directions From the tip of every light ray,

source: །ཞིང་མང་བསམ་གྱིས་མི་ཁྱབ་གང་ཡོད་པ། །དེ་དག་རང་གི་ལག་ཏུ་མངོན་སྤྲུལ་ཏེ།
en: “Making magically appear in their own hands Unimaginably numerous realms,

source: །སྒྱུ་མའི་ཚུལ་དེ་རྟོགས་པར་བྱ་བའི་ཕྱིར།
en: In order to understand how everything is illusory

source: །ཞིང་རྣམས་ཇི་ལྟར་དེ་བཞིན་སེམས་ཅན་ཀུན།།གནོད་པ་མེད་པར་ལག་པའི་མཐིལ་བཞག་ནས།
en: “Placing, just like those realms, all sentient beings On the palms of their hands without harming them

source: །ཆོས་རྣམས་སྲོག་མེད་རྟོགས་པར་བྱ་བའི་ཕྱིར།
en: In order to understand that all phenomena are without life-force,

source: རྒྱ་མཚོ་རྣམས་ན་ཇི་སྙེད་ཆུ་ཡོད་པ།
en: “Taking all the water of the great ocean

source: །སྐྲ་རྩེའི་ཐིགས་པའི་ནང་དུ་འཇུག་པར་བྱེད།
en: And placing it as a single drop on the tip of a hair,

source: །མ་ལུས་མཐར་ཐུག་རྟོགས་པར་བྱ་བའི་ཕྱིར།
en: In order to understand the ultimate extent,

source: །ཞིང་རྣམས་ཀུན་ན་ཕྲ་རབ་རྡུལ་གྱི་བག །གང་ཡོད་དེ་དག་མ་ལུས་བགྲང་བྱེད་ཅིང་།
en: “Counting all the infinitesimal particles, However tiny, that constitute all the worlds,

source: །ཕྲ་རབ་རྡུལ་གྲངས་རྟོགས་པར་བྱ་བའི་ཕྱིར།
en: In order to understand the number of those infintesimal atoms,

source: །འཇིག་རྟེན་འདི་ན་འདས་དང་དེ་བཞིན་དུ། །མ་འོངས་སྲེག་པའི་བསྐལ་པས་འཇིགས་པ་རྣམས། །བསྐལ་པ་ཟད་པ་རྟོགས་པར་བྱ་བའི་ཕྱིར།
en: “In order to understand how eons come to an end, How in this world in the past there has been a time of destruction by burning in this world in the past That will happen likewise in the future,

source: དུས་གསུམ་དག་གི་དེ་བཞིན་གཤེགས་རྣམས་དང་། །སྟོན་པ་རང་རྒྱལ་ཐོས་ལས་བྱུང་རྣམས་ཀྱི། །ཆོས་ཀྱི་རང་བཞིན་རྟོགས་པར་བྱ་བའི་ཕྱིར།
en: “In order to understand the nature of the teachings Of the tathāgatas of the three times, of the teachers, Of pratyekabuddhas, and of śrāvakas,

source: བརྗོད་དུ་མེད་པའི་འཇིག་རྟེན་ཁམས་ཀྱི་རྣམས། །སྐྲ་ཡིས་བཅིངས་ནས་མ་ལུས་སྲང་ལ་འདེབས། །དངོས་པོའི་རང་བཞིན་རྟོགས་པར་བྱ་བའི་ཕྱིར། །
en: “In order to understand the nature of entities, To bind inexpressibly vast worlds with a hair And weigh them on a scale,

source: བྱང་ཆུབ་དོན་དུ་བརྟན་པ་སེམས་འདི་འཇོག །
en: They set their thought firmly on the goal of awakening.

source: ཁོར་ཡུག་རི་བོ་བསམ་གྱིས་མི་ཁྱབ་པ། །སྐྲ་ཡིས་བཅིངས་ནས་མ་ལུས་སྲང་ལ་འདེབས། །རགས་དང་ཕྲ་བ་རྟོགས་པར་བྱ་བའི་ཕྱིར།
en: “In order to understand coarse and fine, To bind a ring of unimaginably huge mountains with a hair And weigh them on a scale,

source: ལུས་པ་མེད་པའི་འཇིག་རྟེན་ཁམས་རྣམས་སུ། །སྐད་ཅིག་གཅིག་ལ་དབྱངས་ཀྱིས་གོ་བར་བྱེད། །དབྱངས་ཀྱི་ཡན་ལག་དག་པ་བསྟན་པའི་ཕྱིར།
en: “In order to display the pure aspects of speech Whose sounds bring understanding in a single instant In all realms of the world without exception,

source: འཇིག་རྟེན་ཀུན་གྱི་སྒྲ་རྣམས་ཅི་འདྲ་བ། །སྐད་ཅིག་གཅིག་ལ་སྐད་ཅིག་རྗོད་བྱེད་ཅིང་། །ཞི་བའི་རང་བཞིན་རྟོགས་པར་བྱ་བའི་ཕྱིར།
en: “In order to understand the nature of peace, Describing it in one instant in a single voice In the languages of all worlds, however they may be,

source: འཇིག་རྟེན་གསུམ་པོ་མ་ལུས་རྟོགས་པར་བྱེད། །སེམས་ཅན་ཀུན་གྱིས་རབ་ཏུ་རྣམ་པར་ཤེས། །ལྕེ་ཡངས་རྒྱ་ཆེན་རྟོགས་པར་བྱ་བའི་ཕྱིར།
en: “In order to understand the Buddha’s vast, wide tongue That informs all three worlds And is known by all sentient beings,

source: །ཞིང་རྣམས་ཀུན་དུ་བརྗོད་དང་འདྲ་བར་ཡང་།
en: “Just as what it pronounces, too, throughout all realms,

source: །སྐད་ཅིག་གཅིག་ལ་ལྟ་གྱུར་སེལ་བར་བྱེད།
en: Clears away views in a single instant,

source: །རྣམ་རྟོག་ཆོས་རྣམས་རྟོགས་པར་བྱ་བའི་ཕྱིར།
en: In order to understand discursive doctrines,

source: །འདིར་ནི་ཞིང་རྣམས་ཐམས་ཅད་མ་ལུས་པར། །དེ་བཞིན་གཤེགས་པས་གང་ཞིང་རང་བྱུང་གི། །ཆོས་རྣམས་སྐད་ཅིག་གཅིག་ལ་རྟོགས་བྱའི་ཕྱིར།
en: “Here, in order to understand in an instant The self-arising teachings Of the tathāgatas filling all worlds,

source: །རྡུལ་ཕྲན་ཐ་དད་ལྟ་བུར་འཇིག་རྟེན་ཁམས། །རྣམ་པ་ཀུན་དུ་མངོན་པར་སྤྲུལ་བྱེད་ཅིང་། །ཡིད་ལས་བྱུང་བདེ་དག་རྟོགས་བྱའི་ཕྱིར།
en: “In order to understand that world realms like diverse atoms Are magically emanated in all their aspects And have arisen from mind,

source: །བྱང་ཆུབ་དོན་དུ་བརྟན་པ་སེམས་འཇོག་བྱེད། །
en: They set their thought firmly on the goal of awakening.

source: འདས་དང་དེ་བཞིན་མ་བྱོན་སངས་རྒྱས་རྣམས། །ཇི་སྙེད་གང་དག་འཇིག་རྟེན་བཞུགས་སོ་ཅོག །སེམས་ཀྱི་སྐད་ཅིག་གཅིག་ལ་རྟོགས་བྱའི་ཕྱིར།
en: “All those buddhas of the past as well as those to come, However many may exist in the world— In order to understand them in a single instant of mind,

source: ཚིག་གཅིག་བརྗོད་ཀྱང་བསམ་གྱིས་མི་ཁྱབ་པའི།། བསྐལ་པ་ཟད་ཀྱི་དེ་ལ་ཉམས་པ་མེད། །ཚིག་རབ་དབྱེ་བ་རྟོགས་པར་བྱ་བའི་ཕྱིར།
en: “Even a single word they have spoken, In order to analyze it in detail with no diminution Even if inconceivably many eons pass,

source: །ཕྱོགས་བཅུ་རྣམས་ཀྱི་འཇིག་རྟེན་ཐམས་ཅད་ཀྱི།། འགྲོ་བ་ཅི་འདྲ་ལྡོག་པ་ཅི་འདྲ་བ།། སེམས་ཀྱི་སྐད་ཅིག་གཅིག་ལ་རྟོགས་བྱའི་ཕྱིར།
en: “In order to understand in a single instant of mind How beings go to all worlds In all ten directions, and how they return,

source: །ཕྱོགས་རྣམས་ཀུན་དུ་འགྲོ་ཡང་ལུས་ཀྱིས་སམ། །ངག་གམ་ཡིད་ཀྱིས་གང་དུའང་ཆགས་པ་མེད།
en: “To go in all directions, yet with no attachment Of body, speech, or mind to anything;

source: །དུས་གསུམ་སྟོང་པ་ཉིད་དུ་རྟོགས་བྱའི་ཕྱིར།
en: In order to understand the three times as empty,

source: །བྱང་ཆུབ་སེམས་ནི་ཇི་ལྟར་བསྐྱེད་པ་བཞིན། །གཞལ་ཡས་བསྐལ་པར་ཕྱོགས་སུ་རྒྱུ་བྱེད་ཅིང་།
en: “To tell them, just as they resolved in their thought of awakening, For infinite eons to go in all directions

source: །སངས་རྒྱས་སྤྱན་སྔར་མཆོད་པར་བྱའོ་ཞེས།
en: And worship in the presence of the buddhas there—

source: །འདི་ནི་མི་ལྡོག་རྣམས་ཀྱི་བསྟན་པ་ཡིན།
en: That is the teaching for those who do not turn back.

source: །ཕྱོགས་བཅུ་དག་གི་འཇིག་རྟེན་ཐ་དད་པར།
en: “In the different worlds of the ten directions,

source: །འཇིག་རྟེན་བདག་པོར་རྒྱལ་བའི་སྲས་འགྱུར་བ།
en: To the lords of those worlds should they, who are the victors’ offspring,

source: །གང་ཡང་རུང་བ་དམ་པ་སྒྲོག་པར་བྱེད།
en: Proclaim as befits them all that is most sublime—

source: །བྱང་ཆུབ་དོན་དུ་སྲིད་པར་སྤྱད་སྤྱོད་ཚེ།
en: “When performing deeds in worldly existence for the sake of awakening,

source: །བྱང་ཆུབ་སེམས་དཔའི་བདེ་སྦྱོར་གང་ཡིན་པ། །དེ་ཡི་བསྔགས་པ་རྟག་ཏུ་རྗོད་པར་བྱེད།
en: To constantly express their praise Of what has brought them the wellbeing of bodhisattvas—

source: །ཆོས་མཆོག་ཆོས་རབ་ཕུལ་དུ་ཕྱིན་པ་དང་། །ཁྱད་པར་འཕགས་ཆོས་བླ་མེད་གང་ཡོད་པ།
en: “The highest Dharma, the superior Dharma that is preeminent, And the extraordinary Dharma that is unsurpassed,

source: །དེ་དག་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་སྟོན། །འདི་ནི་མི་ལྡོག་རྣམས་ཀྱི་བསྟན་པ་ཡིན།
en: These are what should be taught to bodhisattvas— That is the teaching for those who do not turn back.

source: །ཡོན་ཏན་ཀུན་ལྡན་དེ་བཞིན་གཤེགས་པ་ཡི། །ཚེ་ཉིད་འདི་ན་ཡོད་ཀྱི་གཞན་མེད་པ། །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སྦྱོར་བར་བྱེད།
en: “Bodhisattvas should apply themselves to none other Than the great ones themselves, the tathāgatas, Those who are endowed with all good qualities—
